In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame({'nombre':  ['Juan','Antonio','Maria','Marta'],
                   'edad': [22, 21, 21, 22],
                   'ciudad': ['Valencia', 'Madrid', 'Alicante', 'Valencia']})
df.set_index('nombre', inplace=True)
df

         edad    ciudad
nombre
Juan       22  Valencia
Antonio    21    Madrid
Maria      21  Alicante
Marta      22  Valencia

In [3]:
df_prg = pd.DataFrame({'nombre': ['Juan','Antonio','Maria','Marta'],
                       'prg': [7.8, 8.4, 6.7, 4.2]})
df_prg

    nombre  prg
0     Juan  7.8
1  Antonio  8.4
2    Maria  6.7
3    Marta  4.2

In [4]:
df_bda = pd.DataFrame({'nombre': ['Juan','Antonio','Maria','Marta'],
                       'bda': [3.6, 7.8, 8.3, 6.4]})
df_bda

    nombre  bda
0     Juan  3.6
1  Antonio  7.8
2    Maria  8.3
3    Marta  6.4

In [5]:
df_result = df.merge(df_prg, on='nombre')
df_result = df_result.merge(df_bda, on='nombre')
df_result.set_index('nombre', inplace=True)
df_result

         edad    ciudad  prg  bda
nombre
Juan       22  Valencia  7.8  3.6
Antonio    21    Madrid  8.4  7.8
Maria      21  Alicante  6.7  8.3
Marta      22  Valencia  4.2  6.4

In [7]:
df=df_result.append(pd.Series([20,'Valencia',4.5,8.2], index=['edad','ciudad','prg','bda'], name='Adrián'))
df

         edad    ciudad  prg  bda
nombre
Juan       22  Valencia  7.8  3.6
Antonio    21    Madrid  8.4  7.8
Maria      21  Alicante  6.7  8.3
Marta      22  Valencia  4.2  6.4
Adrián     20  Valencia  4.5  8.2

In [38]:
df[['prg','bda']].mean()

prg    6.32
bda    6.86
dtype: float64

In [39]:
df.at['Adrián','prg']=5.2
df

         edad    ciudad  prg  bda
nombre
Juan       22  Valencia  7.8  3.6
Antonio    21    Madrid  8.4  7.8
Maria      21  Alicante  6.7  8.3
Marta      22  Valencia  4.2  6.4
Adrián     20  Valencia  5.2  8.2

In [40]:
df[(df.ciudad=='Valencia')]['bda']

nombre
Juan      3.6
Marta     6.4
Adrián    8.2
Name: bda, dtype: float64

In [42]:
df.groupby('ciudad').bda.mean()

ciudad
Alicante    8.300000
Madrid      7.800000
Valencia    6.066667
Name: bda, dtype: float64

In [43]:
df['media']=(df.prg+df.bda)/2
df

         edad    ciudad  prg  bda  media
nombre
Juan       22  Valencia  7.8  3.6    5.7
Antonio    21    Madrid  8.4  7.8    8.1
Maria      21  Alicante  6.7  8.3    7.5
Marta      22  Valencia  4.2  6.4    5.3
Adrián     20  Valencia  5.2  8.2    6.7